# Rebar Shape Driven Accessor Compute Driving Curves Method

Source: https://www.revitapidocs.com/2026/46288659-93f8-62ee-2d7b-94b7a84e44ab.htm

---

| Rebar Shape Driven Accessor Compute Driving Curves Method |
| --- |

Compute the driving curves.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<Curve> ComputeDrivingCurves()
```

```
Public Function ComputeDrivingCurves As IList(Of Curve)
```

```
public:
IList<Curve^>^ ComputeDrivingCurves()
```

```
member ComputeDrivingCurves : unit -> IList<Curve>
```

#### Return Value

IList Curve
Returns an empty array if an error is encountered. Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

Remarks The driving curves are the ones that appear in rebar sketch
 mode. They include lines and arcs that drive the shape, but
 exclude fillets, hooks and cranks. They always lie in a plane\-\-
 if the bar is 3D, these curves are a subset or a projection.
 They are also used for shape matching. See Also

#### Reference

RebarShapeDrivenAccessor Class Autodesk.Revit.DB.Structure Namespace